// 现有二维数组，var  array=[[1,2,8,9],[2,4,9,12],[4,7,10,13],[6,8,11,15]];
//    1. 遍历打印二维数组的所有元素
//    2. 计算二维数组中所有元素的和
//    3. 求二维数组中所有元素的最大值。

// var arr = [[1, 2, 8, 9], [2, 4, 9, 12], [4, 7, 10, 13], [6, 8, 11, 15]];
// var sum = 0;
// var max = arr[0][0];
// // 遍历打印二维数组的所有元素
// // 分析: 遍历二维数组就是用嵌套for循环 打印就可以了
// for (var i = 0; i < arr.length; i++) {
//     for (var j = 0; j < arr[i].length; j++) {
//         if (arr[i][j] > max) {
//             max = arr[i][j];
//         }
//         console.log(arr[i][j])
//         sum += arr[i][j];

//     }
// }
// console.log("和是:" + sum + ",最大值是:" + max);

// 计算二维数组中所有元素的和


// 求二维数组中所有元素的最大值。

