// 11.商场推出幸运抽奖活动，抽奖规则如下：
//   (1)用户输入一个四位数字(1000-9999的数字),作为顾客的会员卡号
//   (2)该会员卡号(四位数字)各位数字之和大于20，则为幸运客户
//   (3)打印格式：
//      请输入4位会员卡号：3569
//      会员卡号3569各位之和：23
//      会员卡号3569是幸运客户

//      请输入4位会员卡号：1234
//      会员卡号3569各位之和：10
//      会员卡号3569不是幸运客户
// var vip = 3589;
// var num1 = vip % 10; //获取个位的值
// var num2 = parseInt(vip / 10 % 10); //获取十位的值
// var num3 = parseInt(vip / 100 % 10); //获取百位的值
// var num4 = parseInt(vip / 1000); //获取千位的值
// var sum = num1 + num2 + num3 + num4; //各位数字之和
// if (sum > 20) {
//     console.log('会员卡号' + vip + '各位之和：' + sum + '会员卡号' + vip + '是幸运客户');
// } else {
//     console.log('会员卡号' + vip + '各位之和:' + sum + '.会员卡号' + vip + '不是幸运客户');
// }
// 12.用户定义一个数字，数字的范围在 1-9999之间，
// 然后输入的数字是 3，则前面补全 3个0，使之成为”0003”
// 如果输入的数字是25，则前面补全2个0,  使之成为”0025”
// 如果输入的数字是146，则前面补全1个0，使之成为”0146”
// 如果输入的数字是1235，则不用补全。
// 最后将结果打印出来。
// var num = 8;
// var num1 = num % 10; //获取个位的值
// var num2 = parseInt(num / 10 % 10); //获取十位的值
// var num3 = parseInt(num / 100 % 10); //获取百位的值
// var num4 = parseInt(num / 1000); //获取千位的值


// // console.log(num1);
// // console.log(num2);
// // console.log(num3);
// // console.log(num4);
// if (num1 > 0) {
//     console.log('' + num4 + num3 + num2 + num1);
// }


// 13.在控制台打印出，数字在1000-9999范围内，包括9000，4位数中能被6整除不能被12整除的所有的数
// for (i = 1000; i <= 9999; i++) {
//     if (i % 6 == 0 && i % 12 != 0) {
//         console.log(i)
//     }
// }


// 14.请按如下要求编写程序,打印菜单:
//   当数字为1时输出菜单"新建";
//   当数字为2时输出菜单"打开文件";
//   当数字为3时输出菜单"保存";
//   当数字为4时输出菜单"刷新";
//   当数字为5时输出菜单"退出",
// var num1 = 5;
// if (num1 == 1) {
//     console.log("新建");
// } else if (num1 == 2) {
//     console.log("打开文件");
// } else if (num1 == 3) {
//     console.log("保存");
// } else if (num1 == 4) {
//     console.log("刷新");
// } else if (num1 == 5) {
//     console.log("退出");
// }


// 15.控制台输出九九乘法表
// for (var i = 1; i <= 9; i++) {
//     for (var j = 1; j <= i; j++) {
//         console.log(j + '*' + i + '=' + i * j);
//     }
// }

// 16.控制台输出1-100能被7整除的所有数字
// for (i = 1; i <= 100; i++) {
//     if (i % 7 == 0) {
//         console.log(i)
//     }
// }
// 17.利用JavaScript完成如下功能：用户输入日期，(例如：周一)，如果是周一，则‘去郊游’；如果是周日，则‘去动物园喽’，如果是
// 周一到周五的任意一天，则‘去上班，加油’，否则‘请输入正确的日期！！！！’
// var today = 8
// if (today <= 7 && today > 0) {
//     if (today == 7) {
//         console.log('去动物园咯')
//     } else if (today == 6) {
//         console.log('去郊游')
//     } else {
//         console.log('去上班，加油')
//     }

// } else {
//     console.log('请输入正确的日期')
// }

// 18.	利用JavaScript编写程序：通过用户输入的时间来判断哪个时间段，
// 请输入 24 小时制的时间，0-24 如果超出“时间输入有误”，如果时间是0点到6点，在控制台输出，现在时间为凌晨"+s+'点，
// 如果时间是7-12，在控制台输出，"现在时间为上午"+s+'点'
// 如果时间是12-22，在控制台输出，现在时间为下午"+(s-12)+'点'
// 如果时间是22-24，在控制台输出，"现在时间为深夜"+(s-12)+'点')
// var num=11;
// if (num<=24&&num>=0) {
//     if (num<=6&&num>=0) {
//         console.log('现在时间为凌晨'+num+'点');
//     }else if (num<=12&&num>=7) {
//         console.log('现在时间为上午'+num+'点');
//     }else if (num<=22&&num>=12) {
//         console.log('现在时间为下午'+num+'点');
//     }else if (num<=24&&num>=22) {
//         console.log('现在时间为深夜'+num+'点');
//     }
// }else{
//     console.log('时间输入有误');
// }
// 19.判断一个整数，属于哪个范围：大于0；小于0；等于0，如果输入的不是数字，则输出，“输入的数值有误”
// var num=18;
// if (num>0) {
//     console.log('大于0');
// }else if (num<0) {
//     console.log('小于0');   
// }else if (num==0) {
//     console.log('等于0');    
// }else {
//     console.log('输入的数值有误');    

// }

// 20.输入一个整数，如果此数为0，则输出"石头", * 如果此数为1，则输出"剪刀",如果此数为2，则输出"布", * 如果为其它，则输出"错误"
// var a = 2
// if (a == 0) {
//     console.log('石头')
// } else if (a == 1) {
//     console.log('剪刀')
// } else if (a == 2) {
//     console.log('布')
// }


// 二、简答题
// // 1. if分支的语法结构是什么
// if (a < 10) {
//     console.log('xxx')
// } else if (a > 10) {
//     console.log('xxx')
// } else {
//     console.log('xxx')
// }
// // 2. for循环语句的语法结构是什么
// for (i = xx; i <= xx; i++) {
//    if(i%xxx==0){ console.log(i)
// }
// }
// // 3. 逻辑运算符有哪些，分别有哪些规则
// 与或非，&& || ！   在与中有一个假便全是假，在或中有一个真的便全是真，非代表相反。
// // 4. 怎么声明一个常量，常量的值是否可以修改，常量的命名规则有什么？
// 使用const声明常量，常量的值不可以修改，常量的命名规则是不能以数字开头，只能包含字母，数字，下划线组成，不能有特殊字符。